## SQL Functions

In [ ]:
-- Find the number of employees
SELECT COUNT(emp_id)
FROM employee;

In [ ]:
-- Find the number of employees that has supervisor
SELECT COUNT(super_id)
FROM employee;

In [ ]:
-- Find the number of female employees born after 1970
SELECT COUNT(emp_id)
FROM employee
WHERE SEX = 'F' AND birth_date > '1970-01-01';

In [ ]:
-- Find the average of all employees salaries
SELECT AVG(salary)
FROM employee;

In [ ]:
-- Find the average of all male employees salaries
SELECT AVG(salary)
FROM employee
WHERE sex = 'M';

In [ ]:
-- Find the sum of all employees salaries
SELECT SUM(salary)
FROM employee;

In [ ]:
-- Find out how many males and females there are
SELECT COUNT(sex), sex
FROM employee
GROUP BY sex;

In [ ]:
-- Find the total sales of each salesman
SELECT SUM(total_sales), emp_id
FROM works_with
GROUP BY emp_id;

In [ ]:
-- Find the total sales of each client
SELECT SUM(total_sales), client_id
FROM works_with
GROUP BY client_id;

## WildCards and Keywords in SQL

Wildcards is basically a way of defining different patterns that we want to match specific pieces of data to.

In [ ]:
-- % = any # characters, _ = one character

-- Find any client's who are an LLC
SELECT *
FROM client
WHERE client_name LIKE '%LLC ';

In [ ]:
-- % = any # characters, _ = one character

-- Find any branch suppliers who are in the label business
SELECT *
FROM branch
WHERE supplier_name LIKE '% Label%';

In [ ]:
-- % = any # characters, _ = one character

-- Find any employee born in october
SELECT *
FROM employee
WHERE birth_Date LIKE '____-10%';

In [ ]:
-- % = any # characters, _ = one character

-- Find any employee born in Febuary
SELECT *
FROM employee
WHERE birth_Date LIKE '____-02%';

In [ ]:
-- % = any # characters, _ = one character

-- Find any clients who are schools 
SELECT *
FROM client
WHERE client_name LIKE '%school%';

## UNION OPERATOR

Union basically combines the results from two separate statements

In [ ]:
-- Find a list of employee and branch names
SELECT first_name
FROM employee; # To selecet all the first names of the emp table

In [ ]:
-- Find a list of employee and branch names
SELECT first_name
FROM employee; # To selecet all the first names of the emp table
UNION
SELECT branch_name
FROM branch;

### Union Conditions

1. They must have the same number of columns

2. They must be the same data types

In [ ]:
-- Find a list of employee, client_name and branch names
SELECT first_name
FROM employee; # To selecet all the first names of the emp table
UNION
SELECT branch_name
FROM branch ; 
UNION
SELECT client_name
FROM client;

In [ ]:
-- Find a list of employee, client_name and branch names
SELECT first_name AS Company_Names
FROM employee; # To selecet all the first names of the emp table
UNION
SELECT branch_name
FROM branch ; 
UNION
SELECT client_name
FROM client;

In [ ]:
-- Find a list of all clients & branch suppliers' names
SELECT client_name
FROM client
UNION
SELECT supplier_name
FROM branch_name

In [ ]:
-- Find a list of all clients & branch suppliers' names & their branch id's
SELECT client_name, branch_id
FROM client
UNION
SELECT supplier_name, branch_id
FROM branch_supplier;

In [ ]:
-- Find a list of all clients & branch suppliers' names & their branch id's
SELECT client_name, client.branch_id
FROM client
UNION
SELECT supplier_name, branch_supplier.branch_id
FROM branch_supplier;

In [ ]:
--Find a list of all money spent by the company 
SELECT salary
FROM employee
UNION
SELECT total_sales    
FROM works_with;

## JOINS (3:01:36)

A Join is used to combine rows from two or more tables based on the related columns.

4 Types of Joins

Inner Join (Normal Join)

Left Join

Right Join

full-Outer Join (Left & Right Joins combined)

In [ ]:
INSERT INTO branch VALUES(4, 'Buffalo', NULL, NULL);

In [ ]:
#Inner Join (Normal Join)
--Find all branches and the names of their managers
SELECT employee.emp_id, employee.first_name, branch.branch_name;
JOIN branch
ON employee.emp_id = branch.mgr_id;

In [ ]:
# Left Join
--Find all branches and the names of their managers
SELECT employee.emp_id, employee.first_name, branch.branch_name;
LEFT JOIN branch
ON employee.emp_id = branch.mgr_id;

In [ ]:
# Right Join
--Find all branches and the names of their managers
SELECT employee.emp_id, employee.first_name, branch.branch_name;
Right JOIN branch
ON employee.emp_id = branch.mgr_id;

### NESTED QUERIES (3:11:51)

A nested query is a query where we use multiple select statement inorder to get a specific piece of information.

In [ ]:
-- Find names of all employees who have
-- sold over 30,000 to a single client

SELECT employee.first_name, employee.last_name
FROM employee
WHERE employee.emp_id IN (
    SELECT works_with.emp_id
    FROM works_with
    WHERE works_with.total_sales > 30000
);

In [ ]:
-- Find all clients who are handled by the branch
-- that Michael Scott manages
--Assume you know Michael's ID

SELECT client.client_name
FROM client
WHERE client.branch_id = (
    SELECT branch.branch_id
    FROM branch
    WHERE brnach.branch_id = 102
    LIMIT 1 # to ensure it returns just one value not multiple
);

### ON DELETE (3:21:53)

In [ ]:
CREATE TABLE branch (
    branch_id INT PRIMARY KEY,
    branch_name VARCHAR(40),
    mgr_id INT,
    mgr_Start_date DATE,
    FOREIGN KEY(mgr_id) REFERENCES employee(emp_id) ON DELETE SET NULL
);

DELETE FROM employee
WHERE emp_id = 102;

SELECT * from branch;

![](pics/ondelete.png)

In [ ]:
CREATE TABLE branch (
    branch_id INT PRIMARY KEY,
    branch_name VARCHAR(40),
    mgr_id INT,
    mgr_Start_date DATE,
    FOREIGN KEY(mgr_id) REFERENCES employee(emp_id) ON DELETE SET NULL
);

DELETE FROM employee
WHERE emp_id = 102;

SELECT * from branch;

![](pics/ondelete1.png)

In [ ]:
CREATE TABLE branch_supplier (
    branch_id INT,
    supplier_name VARCHAR(40),
    supply_type VARCHAR(40),
    PRIMARY KEY(branch_id, supplier_name),
    FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE CASCADE
);

DELETE FROM branch
WHERE branch_id = 2;

SELECT * from branch_supplier;

![](pics/ondeletecas.png)

In [ ]:
CREATE TABLE branch_supplier (
    branch_id INT,
    supplier_name VARCHAR(40),
    supply_type VARCHAR(40),
    PRIMARY KEY(branch_id, supplier_name),
    FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE CASCADE
);


CREATE TABLE branch (
    branch_id INT PRIMARY KEY,
    branch_name VARCHAR(40),
    mgr_id INT,
    mgr_Start_date DATE,
    FOREIGN KEY(mgr_id) REFERENCES employee(emp_id) ON DELETE SET NULL
);

### TRIGGERS (3:30:06)

In [ ]:
CREATE TABLE trigger_test (
    message VARCHAR(100)
); # Create a table with one field called "messsage"

In [ ]:
DELIMITER $$
CREATE
    TRIGGER my_trigger BEFORE INSERT
    ON employee
    FOR EACH ROW BEGIN
        INSERT INTO trigger_test VALUES('added new employee');
    END$$
DELIMITER;

In [ ]:
# TO ADD NEW ENTRY
DELIMITER $$
CREATE
    TRIGGER my_trigger BEFORE INSERT
    ON employee
    FOR EACH ROW BEGIN
        INSERT INTO trigger_test VALUES('added new employee');
    END$$
DELIMITER;

INSERT INTO employee
VALUES(109, 'Oscar', 'Martinez', '1968-02-19', 'M', 69000, 106, 3);

SELECT * FROM trigger_test;

In [ ]:
# TO ADD NEW ENTRY
DELIMITER $$
CREATE
    TRIGGER my_trigger BEFORE INSERT
    ON employee
    FOR EACH ROW BEGIN
        INSERT INTO trigger_test VALUES('added new employee');
    END$$
DELIMITER;

INSERT INTO employee
VALUES(110, 'Kevin', 'Malone', '1978-02-19', 'M', 69000, 106, 3);

SELECT * FROM trigger_test;

In [ ]:
# add new entries using conditions
DELIMITER $$
CREATE
    TRIGGER my_trigger2 BEFORE INSERT
    ON employee
    FOR EACH ROW BEGIN
        IF NEW.sex = 'M' THEN
            INSERT INTO trigger_test VALUES('added male employee');
        ELSEIF NEW.sex = 'F' THEN
            INSERT INTO trigger_test VALUES('added female');
        ELSE
            INSERT INTO trigger_test VALUES('added other employee');
        END IF;
    END$$
DELIMITER;

INSERT INTO employee
VALUES(111, 'Pam', 'Beesly', '1988-02-19', 'f', 69000, 106, 3);

SELECT * FROM trigger_test;